result of plan,

```
$ terraform plan
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0c0063719053916fd]
module.ecs.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:804464997158:cluster/atlantis]
aws_cloudwatch_log_group.atlantis: Refreshing state... [id=atlantis]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-094742232bd5e527a]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0e922a5002add8853]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0acf5973d9f72f49e]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-06d9174ee2483e072]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-030fa5c5a3cdc9b58]
module.alb_https_sg.module.sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-09c720ad0136715c1]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0fbcf07c85bd5e9b0]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-00b71fec50b5c1ac1]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-04f3954fdcdc464cc]
module.alb_http_sg.module.sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0ac45ed33679c137b]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0e922a5002add88531080289494]
module.alb_https_sg.module.sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-1052403968]
module.alb_https_sg.module.sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-4133695268]
module.alb_https_sg.module.sg.aws_security_group_rule.ingress_with_self[0]: Refreshing state... [id=sgrule-3227126067]
module.alb_http_sg.module.sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-1222689245]
module.alb_http_sg.module.sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-2340891955]
module.alb_http_sg.module.sg.aws_security_group_rule.ingress_with_self[0]: Refreshing state... [id=sgrule-3102628661]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0f95696df900098e8]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-05287abddd74bcee6]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-04cfcee305e537484]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0ffd1a85322b1971c]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-04dfd242c0959d5d8]
module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:804464997158:loadbalancer/app/atlantis/4a255769da024305]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-030fa5c5a3cdc9b581080289494]
module.alb.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:804464997158:targetgroup/atlantis/eaf0519f7d8751df]
module.alb.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:804464997158:listener/app/atlantis/4a255769da024305/c5cad1a686632932]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecs_task_definition.atlantis will be created
  + resource "aws_ecs_task_definition" "atlantis" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu                    = 256
                  + environment            = [
                      + {
                          + name  = "ATLANTIS_ALLOW_REPO_CONFIG"
                          + value = "false"
                        },
                      + {
                          + name  = "ATLANTIS_ATLANTIS_URL"
                          + value = "http://figure-out-later"
                        },
                      + {
                          + name  = "ATLANTIS_GH_USER"
                          + value = ""
                        },
                      + {
                          + name  = "ATLANTIS_HIDE_PREV_PLAN_COMMENTS"
                          + value = "false"
                        },
                      + {
                          + name  = "ATLANTIS_LOG_LEVEL"
                          + value = "debug"
                        },
                      + {
                          + name  = "ATLANTIS_PORT"
                          + value = "4141"
                        },
                      + {
                          + name  = "ATLANTIS_REPO_WHITELIST"
                          + value = "github.com/terraform-aws-modules/*"
                        },
                    ]
                  + essential              = true
                  + image                  = "runatlantis/atlantis:latest"
                  + logConfiguration       = {
                      + logDriver     = "awslogs"
                      + options       = {
                          + awslogs-group         = "atlantis"
                          + awslogs-region        = "us-east-1"
                          + awslogs-stream-prefix = "ecs"
                        }
                      + secretOptions = []
                    }
                  + memory                 = 512
                  + memoryReservation      = 128
                  + mountPoints            = []
                  + name                   = "atlantis"
                  + portMappings           = [
                      + {
                          + containerPort = 4141
                          + hostPort      = 4141
                          + protocol      = "tcp"
                        },
                    ]
                  + readonlyRootFilesystem = false
                  + secrets                = [
                      + {
                          + name      = "ATLANTIS_GH_TOKEN"
                          + valueFrom = "/atlantis/github/user/token"
                        },
                      + {
                          + name      = "ATLANTIS_GH_WEBHOOK_SECRET"
                          + valueFrom = "/atlantis/webhook/secret"
                        },
                    ]
                  + startTimeout           = 30
                  + stopTimeout            = 30
                  + volumesFrom            = []
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "atlantis"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags                     = {
          + "Name" = "atlantis"
        }
      + task_role_arn            = (known after apply)
    }

  # aws_iam_role.ecs_task_execution will be created
  + resource "aws_iam_role" "ecs_task_execution" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "atlantis-ecs_task_execution"
      + path                  = "/"
      + tags                  = {
          + "Name" = "atlantis"
        }
      + unique_id             = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```